2152165718hd-crypto/STM32-/基于STM32的宠物喂养自动控制系统设计/4.案例程序/基于STM32的宠物喂养自动控制系统设计/Drivers/Hardware/AirM2M_4G/AirM2M_4G.c
#include ".\Hardware\AirM2M_4G\AirM2M_4G.h"

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

typedef struct
{
    uint8_t waiting;
    const char *expect1;
    const char *expect2;
    AirM2M_4G_Result_t result;
} AirM2M_4G_WaitContext_t;

static UART_HandleTypeDef s_air_uart;
static uint8_t s_air_inited = 0U;
static volatile uint16_t s_rx_head = 0U;
static volatile uint16_t s_rx_tail = 0U;
static uint8_t s_rx_ring[AIRM2M_4G_RX_BUFFER_SIZE];
static uint8_t s_rx_byte = 0U;

static char s_line_buf[AIRM2M_4G_LINE_BUFFER_SIZE];
static uint16_t s_line_len = 0U;
static char s_mqtt_topic[AIRM2M_4G_TOPIC_BUFFER_SIZE];
static char s_mqtt_payload[AIRM2M_4G_PAYLOAD_BUFFER_SIZE];
static char s_publish_payload[AIRM2M_4G_PAYLOAD_BUFFER_SIZE];
static char s_at_cmd[AIRM2M_4G_LINE_BUFFER_SIZE];
static char s_last_line[AIRM2M_4G_LINE_BUFFER_SIZE];
static uint32_t s_last_line_tick = 0U;
static char *s_debug_response = NULL;
static uint16_t s_debug_response_size = 0U;

static AirM2M_4G_Status_t s_status = AIRM2M_4G_STATUS_RESET;
static uint8_t s_mqtt_connected = 0U;
static uint8_t s_subscribed = 0U;
static AirM2M_4G_WaitContext_t s_wait = {0};
static AirM2M_4G_MqttMessageCallback_t s_mqtt_message_cb = NULL;
static AirM2M_4G_WaitCallback_t s_wait_callback = NULL;

static void AirM2M_4G_ClearUartError(void)
{
    if (s_air_uart.Instance == NULL)
    {
        return;
    }

    __HAL_UART_CLEAR_PEFLAG(&s_air_uart);
    s_air_uart.ErrorCode = HAL_UART_ERROR_NONE;
}

static void AirM2M_4G_StartRxIT(uint8_t clear_error)
{
    if ((s_air_inited == 0U) || (s_air_uart.Instance == NULL))
    {
        return;
    }

    if (s_air_uart.RxState != HAL_UART_STATE_BUSY_RX)
    {
        if (clear_error != 0U)
        {
            AirM2M_4G_ClearUartError();
        }
        (void)HAL_UART_Receive_IT(&s_air_uart, &s_rx_byte, 1U);
    }
}

static void AirM2M_4G_RunWaitCallback(void)
{
    if (s_wait_callback != NULL)
    {
        s_wait_callback();
    }
}

static void AirM2M_4G_CooperativeDelay(uint32_t delay_ms)
{
    uint32_t start = HAL_GetTick();

    while ((HAL_GetTick() - start) < delay_ms)
    {
        AirM2M_4G_Process();
        AirM2M_4G_RunWaitCallback();
        HAL_Delay(1U);
    }
}

static void AirM2M_4G_GPIOClockEnable(GPIO_TypeDef *port)
{
    if (port == GPIOA)
    {
        __HAL_RCC_GPIOA_CLK_ENABLE();
    }
    else if (port == GPIOB)
    {
        __HAL_RCC_GPIOB_CLK_ENABLE();
    }
    else if (port == GPIOC)
    {
        __HAL_RCC_GPIOC_CLK_ENABLE();
    }
#if defined(GPIOD)
    else if (port == GPIOD)
    {
        __HAL_RCC_GPIOD_CLK_ENABLE();
    }
#endif
#if defined(GPIOE)
    else if (port == GPIOE)
    {
        __HAL_RCC_GPIOE_CLK_ENABLE();
    }
#endif
}

static void AirM2M_4G_USARTClockEnable(void)
{
#if defined(USART1)
    if (AIRM2M_4G_USART == USART1)
    {
        __HAL_RCC_USART1_CLK_ENABLE();
    }
    else
#endif
#if defined(USART2)
        if (AIRM2M_4G_USART == USART2)
    {
        __HAL_RCC_USART2_CLK_ENABLE();
    }
    else
#endif
#if defined(USART3)
        if (AIRM2M_4G_USART == USART3)
    {
        __HAL_RCC_USART3_CLK_ENABLE();
    }
    else
#endif
    {
    }
}

static void AirM2M_4G_RXPush(uint8_t data)
{
    uint16_t next = (uint16_t)((s_rx_head + 1U) % AIRM2M_4G_RX_BUFFER_SIZE);

    if (next != s_rx_tail)
    {
        s_rx_ring[s_rx_head] = data;
        s_rx_head = next;
    }
}

static uint8_t AirM2M_4G_RXPop(uint8_t *data)
{
    if ((data == NULL) || (s_rx_tail == s_rx_head))
    {
        return 0U;
    }

    *data = s_rx_ring[s_rx_tail];
    s_rx_tail = (uint16_t)((s_rx_tail + 1U) % AIRM2M_4G_RX_BUFFER_SIZE);
    return 1U;
}

static void AirM2M_4G_ResetRxParser(void)
{
    s_line_len = 0U;
    memset(s_line_buf, 0, sizeof(s_line_buf));
}

static void AirM2M_4G_CompleteWait(AirM2M_4G_Result_t result)
{
    if (s_wait.waiting != 0U)
    {
        s_wait.result = result;
        s_wait.waiting = 0U;
    }
}

static uint8_t AirM2M_4G_LineMatches(const char *line, const char *expect)
{
    if ((line == NULL) || (expect == NULL))
    {
        return 0U;
    }

    return (strstr(line, expect) != NULL) ? 1U : 0U;
}

static void AirM2M_4G_CaptureDebugLine(const char *line)
{
    if ((s_debug_response == NULL) || (s_debug_response_size == 0U) ||
        (line == NULL) || (line[0] == '\0'))
    {
        return;
    }

    if ((strcmp(line, "OK") == 0) && (s_debug_response[0] != '\0'))
    {
        return;
    }

    memset(s_debug_response, 0, s_debug_response_size);
    strncpy(s_debug_response, line, s_debug_response_size - 1U);
}

static void AirM2M_4G_ParseMqttStatus(const char *line)
{
    const char *colon = NULL;

    if (line == NULL)
    {
        return;
    }

    colon = strchr(line, ':');
    if (colon == NULL)
    {
        return;
    }

    while ((*colon == ':') || (*colon == ' '))
    {
        colon++;
    }

    if (*colon == '1')
    {
        s_mqtt_connected = 1U;
        if (s_status < AIRM2M_4G_STATUS_MQTT_CONNECTED)
        {
            s_status = AIRM2M_4G_STATUS_MQTT_CONNECTED;
        }
    }
    else if (*colon == '0')
    {
        s_mqtt_connected = 0U;
        s_subscribed = 0U;
        s_status = AIRM2M_4G_STATUS_CLOSED;
    }
    else
    {
        s_mqtt_connected = 0U;
        s_subscribed = 0U;
        s_status = AIRM2M_4G_STATUS_CLOSED;
    }
}

static void AirM2M_4G_HandleMqttMessage(const char *line)
{
    const char *topic_start = NULL;
    const char *topic_end = NULL;
    const char *len_start = NULL;
    const char *byte_mark = NULL;
    const char *payload_start = NULL;
    uint32_t payload_len = 0U;
    uint16_t topic_len = 0U;
    uint16_t copy_len = 0U;

    if ((line == NULL) || (s_mqtt_message_cb == NULL))
    {
        return;
    }

    topic_start = strchr(line, '"');
    if (topic_start == NULL)
    {
        return;
    }
    topic_start++;

    topic_end = strchr(topic_start, '"');
    if (topic_end == NULL)
    {
        return;
    }

    topic_len = (uint16_t)(topic_end - topic_start);
    if (topic_len >= sizeof(s_mqtt_topic))
    {
        topic_len = (uint16_t)(sizeof(s_mqtt_topic) - 1U);
    }

    memset(s_mqtt_topic, 0, sizeof(s_mqtt_topic));
    memcpy(s_mqtt_topic, topic_start, topic_len);

    len_start = strchr(topic_end + 1, ',');
    if (len_start == NULL)
    {
        return;
    }
    len_start++;

    payload_len = (uint32_t)strtoul(len_start, NULL, 10);
    byte_mark = strstr(len_start, "byte,");
    if (byte_mark == NULL)
    {
        byte_mark = strstr(len_start, "BYTE,");
    }
    if (byte_mark == NULL)
    {
        return;
    }

    payload_start = byte_mark + 5;
    if (payload_len == 0U)
    {
        payload_len = (uint32_t)strlen(payload_start);
    }
    else if (payload_len > (uint32_t)strlen(payload_start))
    {
        payload_len = (uint32_t)strlen(payload_start);
    }

