2152165718hd-crypto/STM32-/基于STM32的宠物喂养自动控制系统设计/4.案例程序/基于STM32的宠物喂养自动控制系统设计/Drivers/Hardware/AirM2M_4G/AirM2M_4G.c
    copy_len = (payload_len >= sizeof(s_mqtt_payload)) ? (uint16_t)(sizeof(s_mqtt_payload) - 1U) : (uint16_t)payload_len;
    memset(s_mqtt_payload, 0, sizeof(s_mqtt_payload));
    memcpy(s_mqtt_payload, payload_start, copy_len);

    s_mqtt_message_cb(s_mqtt_topic, s_mqtt_payload, copy_len);
}

static void AirM2M_4G_HandleLine(const char *line)
{
    if ((line == NULL) || (line[0] == '\0'))
    {
        return;
    }

    memset(s_last_line, 0, sizeof(s_last_line));
    strncpy(s_last_line, line, sizeof(s_last_line) - 1U);
    s_last_line_tick = HAL_GetTick();
    AirM2M_4G_CaptureDebugLine(line);

    if ((strcmp(line, "ERROR") == 0) || (strstr(line, "+CME ERROR") != NULL))
    {
        s_status = AIRM2M_4G_STATUS_ERROR;
        AirM2M_4G_CompleteWait(AIRM2M_4G_ERROR);
        return;
    }

    if ((strcmp(line, "CLOSED") == 0) ||
        (strstr(line, "CLOSE OK") != NULL) ||
        (strstr(line, "DISCONNECT") != NULL) ||
        (strstr(line, "PDP DEACT") != NULL))
    {
        s_mqtt_connected = 0U;
        s_subscribed = 0U;
        s_status = AIRM2M_4G_STATUS_CLOSED;
        if (strcmp(line, "CLOSED") == 0)
        {
            AirM2M_4G_CompleteWait(AIRM2M_4G_ERROR);
            return;
        }
    }

    if ((strstr(line, "CONNECT FAIL") != NULL) ||
        (strstr(line, "CONNECT ERROR") != NULL) ||
        (strstr(line, "CONNACK FAIL") != NULL) ||
        (strstr(line, "CONNACK ERROR") != NULL))
    {
        s_mqtt_connected = 0U;
        s_subscribed = 0U;
        s_status = AIRM2M_4G_STATUS_ERROR;
        AirM2M_4G_CompleteWait(AIRM2M_4G_ERROR);
        return;
    }

    if (strstr(line, "+MQTTSTATU") != NULL)
    {
        AirM2M_4G_ParseMqttStatus(line);
    }

    if (strstr(line, "+MSUB:") == line)
    {
        AirM2M_4G_HandleMqttMessage(line);
    }

    if (strstr(line, "CONNECT OK") != NULL)
    {
        s_status = AIRM2M_4G_STATUS_TCP_CONNECTED;
    }
    else if (strstr(line, "CONNACK OK") != NULL)
    {
        s_mqtt_connected = 1U;
        s_status = AIRM2M_4G_STATUS_MQTT_CONNECTED;
    }
    else if (strstr(line, "SUBACK") != NULL)
    {
        s_subscribed = 1U;
        s_status = AIRM2M_4G_STATUS_SUBSCRIBED;
    }

    if (s_wait.waiting != 0U)
    {
        if ((s_wait.expect1 != NULL) &&
            (AirM2M_4G_LineMatches(line, s_wait.expect1) != 0U))
        {
            AirM2M_4G_CompleteWait(AIRM2M_4G_OK);
        }
        else if ((s_wait.expect2 != NULL) &&
                 (AirM2M_4G_LineMatches(line, s_wait.expect2) != 0U))
        {
            AirM2M_4G_CompleteWait(AIRM2M_4G_OK);
        }
        else if ((s_wait.expect1 == NULL) && (strcmp(line, "OK") == 0))
        {
            AirM2M_4G_CompleteWait(AIRM2M_4G_OK);
        }
    }
}

void AirM2M_4G_Process(void)
{
    uint8_t data = 0U;

    while (AirM2M_4G_RXPop(&data) != 0U)
    {
        if ((data == '\r') || (data == '\n'))
        {
            if (s_line_len > 0U)
            {
                s_line_buf[s_line_len] = '\0';
                AirM2M_4G_HandleLine(s_line_buf);
                AirM2M_4G_ResetRxParser();
            }
        }
        else
        {
            if (s_line_len < (AIRM2M_4G_LINE_BUFFER_SIZE - 1U))
            {
                s_line_buf[s_line_len++] = (char)data;
            }
            else
            {
                AirM2M_4G_ResetRxParser();
            }
        }
    }
}

static AirM2M_4G_Result_t AirM2M_4G_SendRaw(const char *data)
{
    uint16_t len = 0U;

    if ((s_air_inited == 0U) || (data == NULL))
    {
        return AIRM2M_4G_PARAM;
    }

    len = (uint16_t)strlen(data);
    if (HAL_UART_Transmit(&s_air_uart, (uint8_t *)data, len, AIRM2M_4G_AT_TIMEOUT_MS) != HAL_OK)
    {
        return AIRM2M_4G_ERROR;
    }

    return AIRM2M_4G_OK;
}

static AirM2M_4G_Result_t AirM2M_4G_SendCommand(const char *cmd,
                                                 const char *expect1,
                                                 const char *expect2,
                                                 uint32_t timeout_ms)
{
    uint32_t start = HAL_GetTick();
    AirM2M_4G_Result_t tx_result;

    if ((cmd == NULL) || (timeout_ms == 0U))
    {
        return AIRM2M_4G_PARAM;
    }

    AirM2M_4G_StartRxIT(1U);

    if (s_wait.waiting != 0U)
    {
        return AIRM2M_4G_BUSY;
    }

    s_wait.expect1 = expect1;
    s_wait.expect2 = expect2;
    s_wait.result = AIRM2M_4G_TIMEOUT;
    s_wait.waiting = 1U;

    tx_result = AirM2M_4G_SendRaw(cmd);
    if (tx_result == AIRM2M_4G_OK)
    {
        tx_result = AirM2M_4G_SendRaw("\r\n");
    }
    if (tx_result != AIRM2M_4G_OK)
    {
        s_wait.waiting = 0U;
        return tx_result;
    }

    while ((HAL_GetTick() - start) < timeout_ms)
    {
        AirM2M_4G_Process();
        AirM2M_4G_RunWaitCallback();
        if (s_wait.waiting == 0U)
        {
            return s_wait.result;
        }
        HAL_Delay(1U);
    }

    s_wait.waiting = 0U;
    return AIRM2M_4G_TIMEOUT;
}

static uint8_t AirM2M_4G_EscapePayload(const char *payload, char *out, uint16_t out_size)
{
    uint16_t pos = 0U;

    if ((payload == NULL) || (out == NULL) || (out_size == 0U))
    {
        return 0U;
    }

    while (*payload != '\0')
    {
        if ((*payload == '"') || (*payload == '\\'))
        {
            if ((pos + 3U) >= out_size)
            {
                return 0U;
            }
            out[pos++] = '\\';
            if (*payload == '"')
            {
                out[pos++] = '2';
                out[pos++] = '2';
            }
            else
            {
                out[pos++] = '5';
                out[pos++] = 'C';
            }
        }
        else
        {
            if ((pos + 1U) >= out_size)
            {
                return 0U;
            }
            out[pos++] = *payload;
        }
        payload++;
    }

    out[pos] = '\0';
    return 1U;
}

static AirM2M_4G_Result_t AirM2M_4G_WaitForATReady(void)
{
    uint8_t retry;
    AirM2M_4G_Result_t result = AIRM2M_4G_TIMEOUT;

    for (retry = 0U; retry < 5U; retry++)
    {
        result = AirM2M_4G_SendCommand("AT", NULL, NULL, AIRM2M_4G_AT_TIMEOUT_MS);
        if (result == AIRM2M_4G_OK)
        {
            s_status = AIRM2M_4G_STATUS_AT_READY;
            return result;
        }
        AirM2M_4G_CooperativeDelay(200U);
    }

    return result;
}

