2152165718hd-crypto/STM32-/基于STM32的宠物喂养自动控制系统设计/4.案例程序/基于STM32的宠物喂养自动控制系统设计/Drivers/Hardware/AirM2M_4G/AirM2M_4G.c
AirM2M_4G_Result_t AirM2M_4G_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    HAL_NVIC_DisableIRQ(AIRM2M_4G_IRQ);
    if (s_air_inited != 0U)
    {
        (void)HAL_UART_AbortReceive(&s_air_uart);
    }
    memset(&s_air_uart, 0, sizeof(s_air_uart));

    __HAL_RCC_AFIO_CLK_ENABLE();
    AirM2M_4G_GPIOClockEnable(AIRM2M_4G_UART_TX_PORT);
    AirM2M_4G_GPIOClockEnable(AIRM2M_4G_UART_RX_PORT);
    AirM2M_4G_USARTClockEnable();
    AIRM2M_4G_USART_REMAP_ENABLE();

    GPIO_InitStruct.Pin = AIRM2M_4G_UART_TX_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(AIRM2M_4G_UART_TX_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = AIRM2M_4G_UART_RX_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(AIRM2M_4G_UART_RX_PORT, &GPIO_InitStruct);

    s_air_uart.Instance = AIRM2M_4G_USART;
    s_air_uart.Init.BaudRate = AIRM2M_4G_BAUDRATE;
    s_air_uart.Init.WordLength = UART_WORDLENGTH_8B;
    s_air_uart.Init.StopBits = UART_STOPBITS_1;
    s_air_uart.Init.Parity = UART_PARITY_NONE;
    s_air_uart.Init.Mode = UART_MODE_TX_RX;
    s_air_uart.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    s_air_uart.Init.OverSampling = UART_OVERSAMPLING_16;

    if (HAL_UART_Init(&s_air_uart) != HAL_OK)
    {
        s_air_inited = 0U;
        s_status = AIRM2M_4G_STATUS_ERROR;
        return AIRM2M_4G_ERROR;
    }

    s_rx_head = 0U;
    s_rx_tail = 0U;
    AirM2M_4G_ResetRxParser();
    memset(s_last_line, 0, sizeof(s_last_line));
    s_last_line_tick = 0U;
    s_wait.waiting = 0U;
    s_wait.result = AIRM2M_4G_OK;
    s_mqtt_connected = 0U;
    s_subscribed = 0U;
    s_status = AIRM2M_4G_STATUS_RESET;
    s_air_inited = 1U;
    AirM2M_4G_ClearUartError();

    HAL_NVIC_SetPriority(AIRM2M_4G_IRQ, 1U, 0U);
    HAL_NVIC_EnableIRQ(AIRM2M_4G_IRQ);

    if (HAL_UART_Receive_IT(&s_air_uart, &s_rx_byte, 1U) != HAL_OK)
    {
        s_air_inited = 0U;
        s_status = AIRM2M_4G_STATUS_ERROR;
        return AIRM2M_4G_ERROR;
    }

    if (AirM2M_4G_WaitForATReady() != AIRM2M_4G_OK)
    {
        return AIRM2M_4G_TIMEOUT;
    }

    (void)AirM2M_4G_SendCommand("ATE0", NULL, NULL, AIRM2M_4G_AT_TIMEOUT_MS);
    return AIRM2M_4G_OK;
}

AirM2M_4G_Result_t AirM2M_4G_CheckNetwork(uint32_t timeout_ms)
{
    uint32_t start = HAL_GetTick();
    AirM2M_4G_Result_t result;

    if (s_air_inited == 0U)
    {
        return AIRM2M_4G_NOT_CONNECTED;
    }

    result = AirM2M_4G_SendCommand("AT+CPIN?", "+CPIN: READY", NULL, AIRM2M_4G_AT_TIMEOUT_MS);
    if (result != AIRM2M_4G_OK)
    {
        return result;
    }
    s_status = AIRM2M_4G_STATUS_SIM_READY;

    (void)AirM2M_4G_SendCommand("AT+CSQ", NULL, NULL, AIRM2M_4G_AT_TIMEOUT_MS);

    while ((HAL_GetTick() - start) < timeout_ms)
    {
        result = AirM2M_4G_SendCommand("AT+CGATT?", "+CGATT: 1", NULL, AIRM2M_4G_AT_TIMEOUT_MS);
        if (result == AIRM2M_4G_OK)
        {
            result = AirM2M_4G_SendCommand("AT+CSTT", NULL, NULL, AIRM2M_4G_AT_TIMEOUT_MS);
            if ((result == AIRM2M_4G_OK) || (result == AIRM2M_4G_ERROR))
            {
                result = AirM2M_4G_SendCommand("AT+CIICR", NULL, NULL, AIRM2M_4G_NET_TIMEOUT_MS);
                if (result == AIRM2M_4G_OK)
                {
                    s_status = AIRM2M_4G_STATUS_NET_READY;
                    return AIRM2M_4G_OK;
                }
            }
        }
        AirM2M_4G_CooperativeDelay(1000U);
    }

    return AIRM2M_4G_TIMEOUT;
}

static void AirM2M_4G_CloseMqttSession(uint8_t keep_network_ready)
{
    if (s_air_inited == 0U)
    {
        return;
    }

    (void)AirM2M_4G_SendCommand("AT+MDISCONNECT", "OK", "DISCONNECT OK", AIRM2M_4G_CLOSE_TIMEOUT_MS);
    AirM2M_4G_CooperativeDelay(100U);
    (void)AirM2M_4G_SendCommand("AT+MIPCLOSE", "OK", "CLOSE OK", AIRM2M_4G_CLOSE_TIMEOUT_MS);

    s_mqtt_connected = 0U;
    s_subscribed = 0U;
    s_status = (keep_network_ready != 0U) ? AIRM2M_4G_STATUS_NET_READY : AIRM2M_4G_STATUS_CLOSED;
}

AirM2M_4G_Result_t AirM2M_4G_MqttConnect(const char *host,
                                          uint16_t port,
                                          const char *client_id,
                                          const char *username,
                                          const char *password,
                                          uint16_t keepalive,
                                          uint8_t clean_session)
{
    int written;
    AirM2M_4G_Result_t result;

    if ((host == NULL) || (client_id == NULL) || (username == NULL) || (password == NULL) ||
        (host[0] == '\0') || (client_id[0] == '\0') || (username[0] == '\0') || (password[0] == '\0'))
    {
        return AIRM2M_4G_PARAM;
    }

    result = AirM2M_4G_CheckNetwork(AIRM2M_4G_NET_TIMEOUT_MS);
    if (result != AIRM2M_4G_OK)
    {
        return result;
    }
    AirM2M_4G_CloseMqttSession(1U);

    written = snprintf(s_at_cmd, sizeof(s_at_cmd), "AT+MCONFIG=\"%s\",\"%s\",\"%s\"", client_id, username, password);
    if ((written < 0) || ((uint32_t)written >= sizeof(s_at_cmd)))
    {
        return AIRM2M_4G_PARAM;
    }
    result = AirM2M_4G_SendCommand(s_at_cmd, NULL, NULL, AIRM2M_4G_AT_TIMEOUT_MS);
    if (result != AIRM2M_4G_OK)
    {
        return result;
    }

    written = snprintf(s_at_cmd, sizeof(s_at_cmd), "AT+MIPSTART=\"%s\",%u", host, (unsigned int)port);
    if ((written < 0) || ((uint32_t)written >= sizeof(s_at_cmd)))
    {
        return AIRM2M_4G_PARAM;
    }
    result = AirM2M_4G_SendCommand(s_at_cmd, "CONNECT OK", "ALREADY CONNECT", AIRM2M_4G_MQTT_TIMEOUT_MS);
    if (result != AIRM2M_4G_OK)
    {
        AirM2M_4G_CloseMqttSession(1U);
        written = snprintf(s_at_cmd, sizeof(s_at_cmd), "AT+MIPSTART=\"%s\",\"%u\"", host, (unsigned int)port);
        if ((written < 0) || ((uint32_t)written >= sizeof(s_at_cmd)))
        {
            return AIRM2M_4G_PARAM;
        }
        result = AirM2M_4G_SendCommand(s_at_cmd, "CONNECT OK", "ALREADY CONNECT", AIRM2M_4G_MQTT_TIMEOUT_MS);
    }
    if (result != AIRM2M_4G_OK)
    {
        AirM2M_4G_CloseMqttSession(0U);
        return result;
    }

    written = snprintf(s_at_cmd,
                       sizeof(s_at_cmd),
                       "AT+MCONNECT=%u,%u",
                       (unsigned int)((clean_session != 0U) ? 1U : 0U),
                       (unsigned int)keepalive);
    if ((written < 0) || ((uint32_t)written >= sizeof(s_at_cmd)))
    {
        return AIRM2M_4G_PARAM;
    }

    result = AirM2M_4G_SendCommand(s_at_cmd, "CONNACK OK", NULL, AIRM2M_4G_MQTT_TIMEOUT_MS);
    if (result == AIRM2M_4G_OK)
    {
        s_mqtt_connected = 1U;
        s_subscribed = 0U;
        s_status = AIRM2M_4G_STATUS_MQTT_CONNECTED;
    }
    else
    {
        AirM2M_4G_CloseMqttSession(0U);
    }
    return result;
}

AirM2M_4G_Result_t AirM2M_4G_MqttSubscribe(const char *topic, uint8_t qos)
{
    int written;
    AirM2M_4G_Result_t result;

    if ((topic == NULL) || (topic[0] == '\0') || (qos > 2U))
    {
        return AIRM2M_4G_PARAM;
    }
    if (s_mqtt_connected == 0U)
    {
        return AIRM2M_4G_NOT_CONNECTED;
    }

    written = snprintf(s_at_cmd, sizeof(s_at_cmd), "AT+MSUB=\"%s\",%u", topic, (unsigned int)qos);
    if ((written < 0) || ((uint32_t)written >= sizeof(s_at_cmd)))
    {
        return AIRM2M_4G_PARAM;
    }

