2152165718hd-crypto/STM32-/基于STM32的宠物喂养自动控制系统设计/4.案例程序/基于STM32的宠物喂养自动控制系统设计/Drivers/Hardware/AirM2M_4G/AirM2M_4G.c
    result = AirM2M_4G_SendCommand(s_at_cmd, "SUBACK", NULL, AIRM2M_4G_MQTT_TIMEOUT_MS);
    if (result == AIRM2M_4G_OK)
    {
        s_subscribed = 1U;
        s_status = AIRM2M_4G_STATUS_SUBSCRIBED;
    }
    return result;
}

AirM2M_4G_Result_t AirM2M_4G_MqttPublish(const char *topic,
                                          const char *payload,
                                          uint8_t qos,
                                          uint8_t retain)
{
    int written;

    if ((topic == NULL) || (payload == NULL) || (topic[0] == '\0') || (qos > 2U))
    {
        return AIRM2M_4G_PARAM;
    }
    if (s_mqtt_connected == 0U)
    {
        return AIRM2M_4G_NOT_CONNECTED;
    }
    if (AirM2M_4G_EscapePayload(payload, s_publish_payload, (uint16_t)sizeof(s_publish_payload)) == 0U)
    {
        return AIRM2M_4G_PARAM;
    }

    written = snprintf(s_at_cmd,
                       sizeof(s_at_cmd),
                       "AT+MPUB=\"%s\",%u,%u,\"%s\"",
                       topic,
                       (unsigned int)qos,
                       (unsigned int)((retain != 0U) ? 1U : 0U),
                       s_publish_payload);
    if ((written < 0) || ((uint32_t)written >= sizeof(s_at_cmd)))
    {
        return AIRM2M_4G_PARAM;
    }

    return AirM2M_4G_SendCommand(s_at_cmd, NULL, NULL, AIRM2M_4G_PUBLISH_TIMEOUT_MS);
}

AirM2M_4G_Result_t AirM2M_4G_QueryMqttStatus(void)
{
    if (s_air_inited == 0U)
    {
        return AIRM2M_4G_NOT_CONNECTED;
    }

    return AirM2M_4G_SendCommand("AT+MQTTSTATU", "+MQTTSTATU", NULL, AIRM2M_4G_AT_TIMEOUT_MS);
}

AirM2M_4G_Result_t AirM2M_4G_DebugCommand(const char *cmd,
                                           const char *expect1,
                                           const char *expect2,
                                           uint32_t timeout_ms,
                                           char *response,
                                           uint16_t response_size)
{
    AirM2M_4G_Result_t result;
    uint32_t start_tick;

    if ((cmd == NULL) || (timeout_ms == 0U))
    {
        return AIRM2M_4G_PARAM;
    }

    if ((response != NULL) && (response_size > 0U))
    {
        response[0] = '\0';
    }

    AirM2M_4G_Process();
    memset(s_last_line, 0, sizeof(s_last_line));
    s_last_line_tick = 0U;
    start_tick = HAL_GetTick();

    s_debug_response = response;
    s_debug_response_size = response_size;
    result = AirM2M_4G_SendCommand(cmd, expect1, expect2, timeout_ms);
    s_debug_response = NULL;
    s_debug_response_size = 0U;

    if ((response != NULL) && (response_size > 0U) &&
        (response[0] == '\0') && (s_last_line[0] != '\0') &&
        ((s_last_line_tick - start_tick) <= timeout_ms))
    {
        strncpy(response, s_last_line, response_size - 1U);
        response[response_size - 1U] = '\0';
    }

    return result;
}

void AirM2M_4G_RegisterMqttMessageCallback(AirM2M_4G_MqttMessageCallback_t cb)
{
    s_mqtt_message_cb = cb;
}

void AirM2M_4G_RegisterWaitCallback(AirM2M_4G_WaitCallback_t cb)
{
    s_wait_callback = cb;
}

AirM2M_4G_Status_t AirM2M_4G_GetStatus(void)
{
    return s_status;
}

const char *AirM2M_4G_GetStatusText(void)
{
    switch (s_status)
    {
    case AIRM2M_4G_STATUS_RESET:
        return "RESET";
    case AIRM2M_4G_STATUS_AT_READY:
        return "AT";
    case AIRM2M_4G_STATUS_SIM_READY:
        return "SIM";
    case AIRM2M_4G_STATUS_NET_READY:
        return "NET";
    case AIRM2M_4G_STATUS_TCP_CONNECTED:
        return "TCP";
    case AIRM2M_4G_STATUS_MQTT_CONNECTED:
        return "MQTT";
    case AIRM2M_4G_STATUS_SUBSCRIBED:
        return "SUB";
    case AIRM2M_4G_STATUS_CLOSED:
        return "CLOSE";
    case AIRM2M_4G_STATUS_ERROR:
        return "ERR";
    default:
        return "UNKN";
    }
}

const char *AirM2M_4G_GetLastLine(void)
{
    return s_last_line;
}

uint32_t AirM2M_4G_GetLastLineTick(void)
{
    return s_last_line_tick;
}

uint8_t AirM2M_4G_IsMqttConnected(void)
{
    return s_mqtt_connected;
}

uint8_t AirM2M_4G_IsSubscribed(void)
{
    return s_subscribed;
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    if ((huart != NULL) && (huart->Instance == AIRM2M_4G_USART))
    {
        AirM2M_4G_RXPush(s_rx_byte);
        AirM2M_4G_StartRxIT(0U);
    }
}

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
    if ((huart != NULL) && (huart->Instance == AIRM2M_4G_USART))
    {
        AirM2M_4G_ClearUartError();
        AirM2M_4G_StartRxIT(0U);
    }
}

void AIRM2M_4G_IRQ_HANDLER(void)
{
    HAL_UART_IRQHandler(&s_air_uart);
}
